Repository: dofy/LinguaDock
Catalog: LinguaDock/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# app.tagline
source: Read any language with ease
zh_hans: 轻松读懂不同语言
zh_hant: 輕鬆讀懂不同語言

# common.cancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# common.ok
source: OK
zh_hans: 好
zh_hant: 好

# common.opensettings
source: Open Settings
zh_hans: 打开设置
zh_hant: 打開設定

# common.settings
source: Settings
zh_hans: 设置
zh_hant: 設定

# error.capture.cropFailed
source: Cropping the capture failed. Drag out the region again.
zh_hans: 截屏裁剪失败，请重新框选。
zh_hant: 擷取畫面的裁切失敗，請重新框選。

# error.capture.noDisplay
source: The display holding that selection couldn’t be found. Try again.
zh_hans: 找不到选区所在的显示器，请重试。
zh_hant: 找不到選取範圍所在的螢幕，請再試一次。

# error.capture.permissionDenied
source: Screen capture needs Screen Recording permission. Allow LinguaDock in System Settings.
zh_hans: 需要「屏幕录制」权限才能截屏识别，请在系统设置中允许 LinguaDock。
zh_hant: 螢幕擷取需要「螢幕錄製」權限，請在「系統設定」中允許 LinguaDock。

# error.contentFiltered
source: The upstream service’s content filter blocked this text (content_filter) and returned no translation.
zh_hans: 上游服务的内容过滤拦下了这段文本（content_filter），没有返回译文。
zh_hant: 上游服務的內容篩選攔下了這段文字（content_filter），沒有傳回譯文。

# error.emptyTranslation
source: The model returned no translation.
zh_hans: 模型没有返回译文。
zh_hant: 模型沒有傳回譯文。

# error.invalidBaseURL
source: The API URL isn’t valid. Check it in Settings.
zh_hans: API URL 无效，请在设置中检查。
zh_hant: API URL 無效，請在設定中檢查。

# error.invalidResponse
source: The service returned a response that couldn’t be read.
zh_hans: 服务返回了无法识别的响应。
zh_hant: 服務傳回了無法辨識的回應。

# error.keychain.save
source: The API key couldn’t be saved to the Keychain (%d).
zh_hans: 无法把 API Key 保存到 Keychain（%d）。
zh_hant: 無法把 API Key 儲存到鑰匙串（%d）。

# error.nomodel
source: Fill in a model name in Settings first.
zh_hans: 请先在设置中填写模型名称。
zh_hant: 請先在設定中填寫模型名稱。

# error.ocr.noText
source: No text was recognized in the image. Try a sharper region.
zh_hans: 图片里没有识别到文字，换一个清晰点的区域再试。
zh_hant: 圖片裡沒有辨識到文字，換一個清楚一點的區域再試。

# error.paste.noImage
source: There is no image on the clipboard. Take a screenshot or copy an image first, then press ⌘⇧V.
zh_hans: 剪贴板里没有图片。先截图或复制一张图，再按 ⌘⇧V。
zh_hant: 剪貼板裡沒有圖片。先截圖或複製一張圖，再按 ⌘⇧V。

# error.server
source: The service request failed (HTTP %1$lld): %2$@
zh_hans: 服务请求失败（HTTP %1$lld）：%2$@
zh_hant: 服務請求失敗（HTTP %1$lld）：%2$@

# error.unknown
source: Unknown error
zh_hans: 未知错误
zh_hant: 未知錯誤

# footer.capture
source: %@ captures the screen
zh_hans: %@ 截屏识别
zh_hant: %@ 擷取螢幕

# footer.pasteboard
source: ⌘⇧V recognizes a clipboard image
zh_hans: ⌘⇧V 识别剪贴板图片
zh_hant: ⌘⇧V 辨識剪貼板圖片

# footer.selection
source: Set a global shortcut to read the selection
zh_hans: 设置全局快捷键以读取选中文本
zh_hant: 設定全域快速鍵以讀取選取的文字

# footer.selection.shortcut
source: %@ reads the selection
zh_hans: %@ 读取选中文本
zh_hant: %@ 讀取選取的文字

# footer.translate
source: ⌘↩ translates
zh_hans: ⌘↩ 翻译
zh_hant: ⌘↩ 翻譯

# lang.ar
source: Arabic
zh_hans: 阿拉伯语
zh_hant: 阿拉伯文

# lang.de
source: German
zh_hans: 德语
zh_hant: 德文

# lang.en
source: English
zh_hans: 英语
zh_hant: 英文

# lang.es
source: Spanish
zh_hans: 西班牙语
zh_hant: 西班牙文

# lang.fr
source: French
zh_hans: 法语
zh_hant: 法文

# lang.hi
source: Hindi
zh_hans: 印地语
zh_hant: 印地文

# lang.id
source: Indonesian
zh_hans: 印度尼西亚语
zh_hant: 印尼文

# lang.it
source: Italian
zh_hans: 意大利语
zh_hant: 義大利文

# lang.ja
source: Japanese
zh_hans: 日语
zh_hant: 日文

# lang.ko
source: Korean
zh_hans: 韩语
zh_hant: 韓文

# lang.ms
source: Malay
zh_hans: 马来语
zh_hant: 馬來文

# lang.nl
source: Dutch
zh_hans: 荷兰语
zh_hant: 荷蘭文

# lang.pl
source: Polish
zh_hans: 波兰语
zh_hant: 波蘭文

# lang.pt
source: Portuguese
zh_hans: 葡萄牙语
zh_hant: 葡萄牙文

# lang.ru
source: Russian
zh_hans: 俄语
zh_hant: 俄文

# lang.th
source: Thai
zh_hans: 泰语
zh_hant: 泰文

# lang.tr
source: Turkish
zh_hans: 土耳其语
zh_hant: 土耳其文

# lang.uk
source: Ukrainian
zh_hans: 乌克兰语
zh_hant: 烏克蘭文

# lang.vi
source: Vietnamese
zh_hans: 越南语
zh_hant: 越南文

# lang.zh-Hans
source: Simplified Chinese
zh_hans: 简体中文
zh_hant: 简体中文

# lang.zh-Hant
source: Traditional Chinese
zh_hans: 繁體中文
zh_hant: 繁體中文

# menu.copy
source: Copy Translation
zh_hans: 复制译文
zh_hant: 複製譯文

# menu.translate
source: Translate
zh_hans: 翻译
zh_hant: 翻譯

# menu.translate.run
source: Translate
zh_hans: 翻译
zh_hant: 翻譯

# recorder.empty
source: Click to record
zh_hans: 点击录制
zh_hant: 點一下開始錄製

# recorder.press
source: Press a shortcut…
zh_hans: 按下快捷键…
zh_hant: 按下快速鍵…

# settings.about.body
source: Read the source, the install notes and the changelog there, or file an issue.
zh_hans: 查看源代码、安装说明与更新记录，或提交问题反馈。
zh_hant: 在那裡查看原始碼、安裝說明與更新記錄，或提交問題回報。

# settings.about.github
source: GitHub project
zh_hans: GitHub 项目
zh_hant: GitHub 專案

# settings.apikey.ollama
source: API Key (optional for Ollama)
zh_hans: API Key（Ollama 可留空）
zh_hant: API Key（Ollama 可留空）

# settings.defaults.body
source: The input language is detected automatically. The target language defaults to Simplified Chinese and can be changed in the main window at any time. Each protocol's API key is stored separately in the macOS Keychain.
zh_hans: 自动检测输入语言；目标语言默认为简体中文，可在主窗口随时切换。各协议的 API Key 分别保存在 macOS Keychain。
zh_hant: 輸入語言會自動偵測；目標語言預設是簡體中文，可以在主視窗隨時切換。各協定的 API Key 分別存在 macOS 鑰匙串裡。

# settings.defaults.ollama
source: Ollama defaults: %1$@ · %2$@
zh_hans: Ollama 默认：%1$@ · %2$@
zh_hant: Ollama 預設：%1$@ · %2$@

# settings.model
source: Model
zh_hans: 模型
zh_hant: 模型

# settings.opensettings
source: Open System Settings
zh_hans: 打开系统设置
zh_hant: 打開系統設定

# settings.permission.accessibility.granted
source: Accessibility granted
zh_hans: 辅助功能已授权
zh_hant: 輔助使用已授權

# settings.permission.accessibility.missing
source: Accessibility not granted
zh_hans: 尚未授权辅助功能
zh_hant: 尚未授權輔助使用

# settings.permission.explain
source: Accessibility is used to read the current selection and to send the copy shortcut. Screen Recording is used only to grab the region you drag out, and only when you press the capture shortcut. Text recognition happens on this machine; only its result is sent to the API you configured.
zh_hans: 辅助功能权限用于读取当前选中文本和发送复制快捷键；屏幕录制权限只在你按下截屏识别快捷键时用于截取所框选的区域。文字识别在本机完成，识别结果仅发送到你配置的 API。
zh_hant: 輔助使用權限用來讀取目前選取的文字，以及送出複製快速鍵；螢幕錄製權限只在你按下擷取快速鍵時，用來擷取你框選的區域。文字辨識在本機完成，只有辨識結果會送到你設定的 API。

# settings.permission.prompt
source: Open the permission prompt
zh_hans: 打开授权提示
zh_hant: 打開授權提示

# settings.permission.screen.granted
source: Screen Recording granted
zh_hans: 屏幕录制已授权
zh_hant: 螢幕錄製已授權

# settings.permission.screen.missing
source: Screen Recording not granted (needed for screen capture)
zh_hans: 尚未授权屏幕录制（截屏识别需要）
zh_hant: 尚未授權螢幕錄製（擷取螢幕需要）

# settings.protocol
source: Protocol
zh_hans: 协议
zh_hant: 協定

# settings.refresh
source: Refresh
zh_hans: 刷新
zh_hant: 重新整理

# settings.section.about
source: About
zh_hans: 关于
zh_hant: 關於

# settings.section.defaults
source: Default behavior
zh_hans: 默认行为
zh_hant: 預設行為

# settings.section.permissions
source: Permissions
zh_hans: 权限
zh_hant: 權限

# settings.section.service
source: Model service
zh_hans: 模型服务
zh_hant: 模型服務

# settings.section.shortcuts
source: Shortcuts
zh_hans: 快捷操作
zh_hant: 快速操作

# settings.shortcut.capture
source: Capture the screen and translate
zh_hans: 截屏识别翻译
zh_hant: 擷取螢幕並翻譯

# settings.shortcut.pasteboard
source: Recognize a clipboard image
zh_hans: 识别剪贴板图片
zh_hant: 辨識剪貼板圖片

# settings.shortcut.selection
source: Read selected text
zh_hans: 读取选中文本
zh_hant: 讀取選取的文字

# settings.status.connected
source: Connected
zh_hans: 连接成功
zh_hant: 連線成功

# settings.status.connecting
source: Connecting…
zh_hans: 正在连接…
zh_hant: 正在連線…

# settings.test
source: Test connection
zh_hans: 测试连接
zh_hant: 測試連線

# status.accessibility.missing
source: No Accessibility permission yet. Grant access here first, then allow LinguaDock in System Settings.
zh_hans: 尚未获得辅助功能权限。请先点击授权，然后在系统设置中允许 LinguaDock。
zh_hant: 還沒取得輔助使用權限。請先點一下授權，然後在「系統設定」中允許 LinguaDock。

# status.cancelled
source: Cancelled
zh_hans: 已取消
zh_hant: 已取消

# status.copied
source: Translation copied
zh_hans: 译文已复制
zh_hant: 譯文已複製

# status.done
source: Translation complete
zh_hans: 翻译完成
zh_hant: 翻譯完成

# status.needtext
source: Type or select the text to translate first.
zh_hans: 先输入或选中要翻译的文本。
zh_hant: 先輸入或選取要翻譯的文字。

# status.noselection
source: Nothing selected was read. Check that there is a selection in the other app, then try again.
zh_hans: 没有读到选中文本。请确认原应用中已有选区，然后重试。
zh_hant: 沒有讀到選取的文字。請確認原本的 App 裡有選取範圍，然後再試一次。

# status.reading
source: Reading the selected text…
zh_hans: 正在读取选中文本…
zh_hant: 正在讀取選取的文字…

# status.recognizing
source: Recognizing the text in the image…
zh_hans: 正在识别图片文字…
zh_hant: 正在辨識圖片裡的文字…

# status.translating
source: Translating with %@…
zh_hans: 正在用 %@ 翻译…
zh_hant: 正在用 %@ 翻譯…

# translator.accessibility.hint
source: Grant Accessibility permission and set a global shortcut to read the selected text in other apps directly.
zh_hans: 授予辅助功能权限并设置全局快捷键后，可直接读取其他 App 的选中文本。
zh_hant: 授予輔助使用權限並設好全域快速鍵之後，就能直接讀取其他 App 選取的文字。

# translator.accessibility.hint.shortcut
source: Once Accessibility permission is granted, %@ reads the selected text in other apps directly.
zh_hans: 授予辅助功能权限后，%@ 可直接读取其他 App 的选中文本。
zh_hant: 授予輔助使用權限之後，%@ 就能直接讀取其他 App 選取的文字。

# translator.alert.title
source: Translation failed
zh_hans: 翻译失败
zh_hant: 翻譯失敗

# translator.banner.grant
source: Grant access
zh_hans: 授权
zh_hant: 授權

# translator.banner.screenrecording
source: Screen capture needs Screen Recording permission. Allow LinguaDock in System Settings, then try again.
zh_hans: 截屏识别需要「屏幕录制」权限。在系统设置中允许 LinguaDock 后重试即可。
zh_hant: 擷取螢幕需要「螢幕錄製」權限。在「系統設定」中允許 LinguaDock 之後再試一次即可。

# translator.capture
source: Capture the screen
zh_hans: 截屏识别
zh_hant: 擷取螢幕

# translator.capture.help
source: Drag out a screen region, recognize the text in it, and translate that
zh_hans: 框选屏幕区域，识别其中文字并翻译
zh_hant: 框選螢幕區域，辨識其中的文字並翻譯

# translator.capture.help.shortcut
source: Drag out a screen region, recognize the text in it, and translate that (%@)
zh_hans: 框选屏幕区域，识别其中文字并翻译（%@）
zh_hant: 框選螢幕區域，辨識其中的文字並翻譯（%@）

# translator.charcount
source: %lld characters
zh_hans: %lld 字符
zh_hant: %lld 個字元

# translator.copy
source: Copy
zh_hans: 复制
zh_hant: 複製

# translator.detect
source: Detect language
zh_hans: 自动检测
zh_hant: 自動偵測

# translator.pasteboard
source: Recognize a clipboard image
zh_hans: 识别剪贴板图片
zh_hant: 辨識剪貼板圖片

# translator.pasteboard.help
source: Recognize the image on the clipboard and translate it (⌘⇧V)
zh_hans: 识别剪贴板里的图片并翻译（⌘⇧V）
zh_hant: 辨識剪貼板裡的圖片並翻譯（⌘⇧V）

# translator.placeholder
source: Type some text, or set a global shortcut in Settings first. ⌘⇧V recognizes an image on the clipboard…
zh_hans: 输入文本，或先在设置中配置全局快捷键；⌘⇧V 可识别剪贴板里的图片…
zh_hant: 輸入文字，或先在設定中設好全域快速鍵；⌘⇧V 可以辨識剪貼板裡的圖片…

# translator.placeholder.shortcut
source: Type some text, or select text in any app and press %@. ⌘⇧V recognizes an image on the clipboard…
zh_hans: 输入文本，在任意 App 中选中文本后按 %@，或 ⌘⇧V 识别剪贴板里的图片…
zh_hant: 輸入文字，或在任何 App 中選取文字後按 %@；⌘⇧V 可以辨識剪貼板裡的圖片…

# translator.result
source: Translation
zh_hans: 译文
zh_hant: 譯文

# translator.result.placeholder
source: The translation will appear here
zh_hans: 译文会出现在这里
zh_hant: 譯文會出現在這裡

# translator.source
source: Source
zh_hans: 原文
zh_hant: 原文

# translator.target
source: Target language
zh_hans: 目标语言
zh_hant: 目標語言

# translator.translate
source: Translate
zh_hans: 翻译
zh_hant: 翻譯
